package Task1;

public class Task3_1 {
/*    В версии языка программирования Java SE 8 с комплектом разработчика JDK 8 и внутренним номером версиипроизошли значительные
    усовершенствования:
    Лямбда-выражения позволяют совершенно иначе подходить к программированию и написанию кода.
    Лямбда-выражения вносят в Java возможности функционального программирования.
    В процессе программирования лямбда-выражения способны упростить и сократить объем исходного кода,-
    требующегося для создания определенных конструкций, в том числе некоторых типов анонимных классов.
    Кроме того, лямбда- выражения вводят в язык новый оператор (->) и элемент синтаксиса.
    Внедрение лямбда-выражений оказало обширное влияние и на библиотеки Java, которые были дополнены новыми средствами,
    выгодно использующими лямбда- выражения. К наиболее важным новшествам в библиотеке Java относится новый прикладной
    программной интерфейс API потоков ввода-вывода, входящий в пакет java.util.stream. В этом прикладном интерфейсе API,
    оптимизированном с учетом лямбда-Выражений, поддерживаются конвейерные операции с данными.
    Еще одним важным новшеством является пакет java.util.function, в котором определен целый ряд функциональных интерфейсов,
    обеспечивающих дополнительную поддержку лямбда-Выражений. В библиотеке Java API внедрены и другиесредства, имеющие отношение
    к лямбда-выражениям.
    Появилась возможность определять реализацию по умолчанию Метода, объявленного в интерфейсе.
    Если конкретная реализация такого метода отсутствует, то используется его реализация по умолчанию в интерфейсе.
    Таким образом, обеспечивается постепенное развитие Интерфейсов, поскольку новый метод может быть введен в интерфейс,
    не нарушая существующий код. Это новшество позволяет также рационализировать реализацию интерфейса при наличии
    подходящих средств, доступных по умолчанию. К числу других средств, появившихся в JDK 8, относятся новый прикладной
    программный интерфейс API для обработки даты и времени, типовые аннотации и возможность использовать параллельную обработку
    при сортировке массива. Кроме того, в состав JDK 8 включена поддержка JavaFX 8 — последней версии нового каркаса (фреймворка)
    приложений Java с ГПИ. Предполагается, что каркас JavaFX станет неотъемлемой частью практически всех приложений Java
    и в конечном итоге заменит Swing для разработки большинства проектов на основе ГПИ.
*/

}
